rough/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


x0  -1000;
x1     35;
x2    500;
y0      0;
y1   0.01;
z0      0;
z1     50;
 
nxa   100;
nxb    50;
nz     20;  


vertices
(

	( $x0 $y0 $z0)
	( $x1 $y0 $z0)
	( $x2 $y0 $z0)
	( $x0 $y0 $z1)
	( $x1 $y0 $z1)
	( $x2 $y0 $z1)
	( $x0 $y1 $z0)
	( $x1 $y1 $z0)
	( $x2 $y1 $z0)
	( $x0 $y1 $z1)
	( $x1 $y1 $z1)
	( $x2 $y1 $z1)

);

blocks
(
	hex (0 1 7 6 3 4 10 9) ($nxa 1 $nz) simpleGrading (1 1 1)
	hex (1 2 8 7 4 5 11 10) ($nxb 1 $nz) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (2 5 11 8)
        );
    }
    sides
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (1 2 5 4)
	    (6 7 10 9)
	    (7 8 11 10)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 3 9 6)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 1 7 6)
	    (1 2 8 7)
        );
    }
    top
    {
        type patch;
        faces
        (
	    (3 4 10 9)
	    (4 5 11 10)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
