rough/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       5830;
    }
    sides
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6000;
        startFace       5850;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       11850;
    }
    ground
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          150;
        startFace       11870;
    }
    top
    {
        type            patch;
        nFaces          150;
        startFace       12020;
    }
)

// ************************************************************************* //
