rough/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{

    outlet
    {
        type            zeroGradient;
    }

//    outlet
//    {
//	type		inletOutlet;
//	inletValue	uniform $turbulentKE;
//	value		$internalField;
//    }
        
    inlet
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
    }


    ridge
    {
	type		kqRWallFunction;
	value		$internalField;
    }

//  ground
//  {
//	type		zeroGradient;
//  }

    ground
    {
        type		kqRWallFunction;
        value		$internalField;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
