rough/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 16;

method          simple;

simpleCoeffs
{
    n               ( 8 1 2 );
    delta           0.001;
}

distributed     no;

roots           ( );
