rough/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

surfaces ("ridge.stl");

includedAngle       150;

subsetFeatures
{
    nonManifoldEdges       no;

    openEdges       yes;
}
